Revit 2023 API
PolylineSegments Class
 An output node that represents a tessellated polyline segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public class PolylineSegments : IDisposable
Visual Basic
Public Class PolylineSegments _
	Implements IDisposable
Visual C++
public ref class PolylineSegments : IDisposable
Remarks
 See also: OnPolylineSegments(PolylineSegments).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PolylineSegments
See Also
PolylineSegments Members
Autodesk.Revit.DB Namespace